public_html/blog_construct.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-01 周一 21:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>通过 ox-publish 创建博客</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../css/org-css.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="preamble" class="status">
<div id=
</div>
<div id="content">
<h1 class="title">通过 ox-publish 创建博客</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc611177">1. 配置 Emacs</a>
<ul>
<li><a href="#org5dee9a1">1.1. 基本配置</a></li>
<li><a href="#org9d15d69">1.2. 添加 disqus 评论</a></li>
<li><a href="#org2f63208">1.3. code 高亮</a></li>
</ul>
</li>
<li><a href="#org5cdd00e">2. 上传 Github</a></li>
<li><a href="#orgfe11d1e">3. 参考资料</a></li>
</ul>
</div>
</div>
<blockquote>
<p>

</p>

<p>
一入 emacs，坑深似海！
</p>
</blockquote>

<p>
昨天，无意之间看到了<a href="https://www.guidao.github.io">guidao 博客的网站</a>，第一眼就喜欢上了，这就是我想要的网站呐，漂亮至极。我一直都觉得，org 生成的 html 效果是最好的。废话不多说，下面说明建站过程记录，同时也会放在我个人<a href="http://tonylu.pe.hu/wiki.html">wiki</a>上。
</p>

<div id="outline-container-orgc611177" class="outline-2">
<h2 id="orgc611177"><span class="section-number-2">1</span> 配置 Emacs</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org5dee9a1" class="outline-3">
<h3 id="org5dee9a1"><span class="section-number-3">1.1</span> 基本配置</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span>abstract class IntQueue 
<span class="linenr"> 2: </span><span style="color: #707183;">(</span>add-to-list 'load-path <span style="color: #008000; font-style: italic;">"~/.emacs.d/elpa/org-20170606"</span><span style="color: #707183;">)</span> <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">;</span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">&#26368;&#26032;&#29256;&#26412;&#30340; org-mode &#30340;&#36335;&#24452;</span>
<span class="linenr"> 3: </span><span style="color: #707183;">(</span><span style="color: #0000FF;">require</span> '<span style="color: #D0372D; font-style: italic;">ox-publish</span><span style="color: #707183;">)</span>
<span class="linenr"> 4: </span><span style="color: #707183;">(</span><span style="color: #0000FF;">require</span> '<span style="color: #D0372D; font-style: italic;">ox-html</span><span style="color: #707183;">)</span>
<span class="linenr"> 5: </span><span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> org-publish-project-alist
<span class="linenr"> 6: </span>'<span style="color: #7388D6;">(</span><span style="color: #909183;">(</span><span style="color: #008000; font-style: italic;">"blog-notes"</span>
<span class="linenr"> 7: </span> <span style="color: #006FE0;">:base-directory</span> <span style="color: #008000; font-style: italic;">"C:/Users/Administrator/Dropbox/org/notes/"</span> <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">;</span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">org &#25991;&#20214;&#30340;&#36335;&#24452;</span>
<span class="linenr"> 8: </span> <span style="color: #006FE0;">:base-extension</span> <span style="color: #008000; font-style: italic;">"org"</span>
<span class="linenr"> 9: </span> <span style="color: #006FE0;">:publishing-directory</span> <span style="color: #008000; font-style: italic;">"C:/Users/Administrator/Dropbox/org/public_html/"</span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">;</span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">&#29983;&#25104;&#30340; html &#25991;&#20214;&#36335;&#24452;</span>
<span class="linenr">10: </span> <span style="color: #006FE0;">:recursive</span> t
<span class="linenr">11: </span> <span style="color: #006FE0;">:publishing-function</span> org-html-publish-to-html <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">;</span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">&#29983;&#25104;&#20989;&#25968;</span>
<span class="linenr">12: </span> <span style="color: #006FE0;">:html-link-home</span> <span style="color: #008000; font-style: italic;">"index.html"</span> <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">;</span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">Home &#25991;&#20214;&#30340;&#36335;&#24452;</span>
<span class="linenr">13: </span> <span style="color: #006FE0;">:html-link-org-files-as-html</span>  org-html-link-org-files-as-html
<span class="linenr">14: </span> <span style="color: #006FE0;">:headline-levels</span> <span style="color: #D0372D; font-style: italic;">5</span>             <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">; </span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">Just the default for this project.</span>
<span class="linenr">15: </span> <span style="color: #006FE0;">:with-author</span> nil <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">;</span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">&#21435;&#25481; author</span>
<span class="linenr">16: </span> <span style="color: #006FE0;">:with-email</span> nil  <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">;</span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">&#21435;&#25481; email</span>
<span class="linenr">17: </span> <span style="color: #006FE0;">:with-creator</span> nil  <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">;</span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">&#21435;&#25481; creator</span>
<span class="linenr">18: </span> <span style="color: #006FE0;">:with-timestamp</span> nil  <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">;</span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">&#21435;&#25481;&#26102;&#38388;&#32447;</span>
<span class="linenr">19: </span> <span style="color: #006FE0;">:html-postamble</span> nil
<span class="linenr">20: </span> <span style="color: #006FE0;">:auto-preamble</span> t
<span class="linenr">21: </span> <span style="color: #006FE0;">:section-numbers</span> nil
<span class="linenr">22: </span> <span style="color: #006FE0;">:html-head</span> <span style="color: #008000; font-style: italic;">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"../css/org-css.css\" /&gt;"</span> <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">;</span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">&#24341;&#20837; css &#25991;&#20214;</span>
<span class="linenr">23: </span> <span style="color: #006FE0;">:auto-sitemap</span> t                <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">; </span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">Generate sitemap.org automagically...</span>
<span class="linenr">24: </span> <span style="color: #006FE0;">:sitemap-filename</span> <span style="color: #008000; font-style: italic;">"sitemap.org"</span>  <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">; </span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">... call it sitemap.org (it's the default)...</span>
<span class="linenr">25: </span> <span style="color: #006FE0;">:sitemap-title</span> <span style="color: #008000; font-style: italic;">"Sitemap"</span>         <span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">; </span><span style="color: #8D8D84; background-color: #ffffff; font-style: italic;">... with title 'Sitemap'.</span>
<span class="linenr">26: </span> <span style="color: #006FE0;">:sitemap-sort-files</span> anti-chronologically
<span class="linenr">27: </span> <span style="color: #006FE0;">:sitemap-file-entry-format</span> <span style="color: #008000; font-style: italic;">"%d %t"</span>
<span class="linenr">28: </span> <span style="color: #909183;">)</span>
<span class="linenr">29: </span><span style="color: #909183;">(</span><span style="color: #008000; font-style: italic;">"blog-static"</span>
<span class="linenr">30: </span> <span style="color: #006FE0;">:base-directory</span> <span style="color: #008000; font-style: italic;">"C:/Users/Administrator/Dropbox/org/notes"</span>
<span class="linenr">31: </span> <span style="color: #006FE0;">:base-extension</span> <span style="color: #008000; font-style: italic;">"css</span><span style="color: #008000; font-weight: bold; font-style: italic;">\\</span><span style="color: #008000; font-weight: bold; font-style: italic;">|</span><span style="color: #008000; font-style: italic;">js</span><span style="color: #008000; font-weight: bold; font-style: italic;">\\</span><span style="color: #008000; font-weight: bold; font-style: italic;">|</span><span style="color: #008000; font-style: italic;">png</span><span style="color: #008000; font-weight: bold; font-style: italic;">\\</span><span style="color: #008000; font-weight: bold; font-style: italic;">|</span><span style="color: #008000; font-style: italic;">jpg</span><span style="color: #008000; font-weight: bold; font-style: italic;">\\</span><span style="color: #008000; font-weight: bold; font-style: italic;">|</span><span style="color: #008000; font-style: italic;">gif</span><span style="color: #008000; font-weight: bold; font-style: italic;">\\</span><span style="color: #008000; font-weight: bold; font-style: italic;">|</span><span style="color: #008000; font-style: italic;">pdf</span><span style="color: #008000; font-weight: bold; font-style: italic;">\\</span><span style="color: #008000; font-weight: bold; font-style: italic;">|</span><span style="color: #008000; font-style: italic;">mp3</span><span style="color: #008000; font-weight: bold; font-style: italic;">\\</span><span style="color: #008000; font-weight: bold; font-style: italic;">|</span><span style="color: #008000; font-style: italic;">ogg</span><span style="color: #008000; font-weight: bold; font-style: italic;">\\</span><span style="color: #008000; font-weight: bold; font-style: italic;">|</span><span style="color: #008000; font-style: italic;">swf"</span>
<span class="linenr">32: </span> <span style="color: #006FE0;">:publishing-directory</span> <span style="color: #008000; font-style: italic;">"C:/Users/Administrator/Dropbox/org/public_html/"</span>
<span class="linenr">33: </span> <span style="color: #006FE0;">:recursive</span> t
<span class="linenr">34: </span> <span style="color: #006FE0;">:publishing-function</span> org-publish-attachment
<span class="linenr">35: </span> <span style="color: #909183;">)</span>
<span class="linenr">36: </span> <span style="color: #909183;">(</span><span style="color: #008000; font-style: italic;">"blog"</span> <span style="color: #006FE0;">:components</span> <span style="color: #709870;">(</span><span style="color: #008000; font-style: italic;">"blog-notes"</span> <span style="color: #008000; font-style: italic;">"blog-static"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
<span class="linenr">37: </span> <span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span class="linenr">38: </span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9d15d69" class="outline-3">
<h3 id="org9d15d69"><span class="section-number-3">1.2</span> 添加 disqus 评论</h3>
<div class="outline-text-3" id="text-1-2">
<p>
首先在<a href="https://tonylu.disqus.com/admin/install/platforms/universalcode/">disqus 网站</a>申请网站评论站点，得到以下代码放到上面的配置文件中。
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="linenr"> 1: </span>abstract class IntQueue 
<span class="linenr"> 2: </span>&lt;div id=<span style="color: #008000; font-style: italic;">"disqus_thread"</span>&gt;&lt;/div&gt;
<span class="linenr"> 3: </span>&lt;script&gt;<span style="color: #707183;">(</span>add-to-list <span style="color: #008000; font-style: italic;">'load-path "~/.emacs.d/elpa/htmlize-20161211.1019")</span>
<span class="linenr"> 4: </span><span style="color: #008000; font-style: italic;">(require '</span>htmlize<span style="color: #707183;">)</span>
<span class="linenr"> 5: </span><span style="color: #707183;">(</span>setq org-html-htmlize-output-type <span style="color: #008000; font-style: italic;">'css)</span>
<span class="linenr"> 6: </span><span style="color: #008000; font-style: italic;">(setq org-html-htmlize-output-type '</span>inline-css<span style="color: #707183;">)</span>
<span class="linenr"> 7: </span>var disqus_config = function <span style="color: #707183;">()</span> <span style="color: #707183;">{</span>
<span class="linenr"> 8: </span>this.page.url = PAGE_URL;  // Replace PAGE_URL with your page<span style="color: #008000; font-style: italic;">'s canonical URL variable</span>
<span class="linenr"> 9: </span><span style="color: #008000; font-style: italic;">this.page.identifier = PAGE_IDENTIFIER; // Replace PAGE_IDENTIFIER with your page'</span>s unique identifier variable
<span class="linenr">10: </span><span style="color: #707183;">}</span>;
<span class="linenr">11: </span><span style="color: #707183;">(</span>function<span style="color: #7388D6;">()</span> <span style="color: #7388D6;">{</span> // DON<span style="color: #008000; font-style: italic;">'T EDIT BELOW THIS LINE</span>
<span class="linenr">12: </span><span style="color: #008000; font-style: italic;">var d = document, s = d.createElement('</span>script<span style="color: #008000; font-style: italic;">');</span>
<span class="linenr">13: </span><span style="color: #008000; font-style: italic;">s.src = '</span>https://tonylu.disqus.com/embed.js<span style="color: #008000; font-style: italic;">';</span>
<span class="linenr">14: </span><span style="color: #008000; font-style: italic;">s.setAttribute('</span>data-timestamp<span style="color: #008000; font-style: italic;">', +new Date());</span>
<span class="linenr">15: </span><span style="color: #008000; font-style: italic;">(d.head || d.body).appendChild(s);</span>
<span class="linenr">16: </span><span style="color: #008000; font-style: italic;">})();</span>
<span class="linenr">17: </span><span style="color: #008000; font-style: italic;">&lt;/script&gt;</span>
<span class="linenr">18: </span><span style="color: #008000; font-style: italic;">&lt;noscript&gt;Please enable JavaScript to view the &lt;a href="https://disqus.com/?ref_noscript"&gt;comments powered by Disqus.</span>
<span class="linenr">19: </span><span style="color: #008000; font-style: italic;">&lt;/a&gt;&lt;/noscript&gt;                             </span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2f63208" class="outline-3">
<h3 id="org2f63208"><span class="section-number-3">1.3</span> code 高亮</h3>
<div class="outline-text-3" id="text-1-3">
<p>
解决这个问题花了好长时间，emacs 学习曲线确实陡峭。在网上，找到了一个<a href="http://www.zmonster.me/2013/12/02/org8.x-export-source-code.html">参考资料</a>。具体做法是这样。首先，加载 htmlize.el，然后在上面配置文件中，添加一行代码。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span>abstract class IntQueue 
<span class="linenr"> 2: </span><span style="color: #707183;">(</span>add-to-list 'load-path <span style="color: #008000; font-style: italic;">"~/.emacs.d/elpa/htmlize-20161211.1019"</span><span style="color: #707183;">)</span>
<span class="linenr"> 3: </span><span style="color: #707183;">(</span><span style="color: #0000FF;">require</span> '<span style="color: #D0372D; font-style: italic;">htmlize</span><span style="color: #707183;">)</span>
<span class="linenr"> 4: </span><span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> org-html-htmlize-output-type 'css<span style="color: #707183;">)</span>
<span class="linenr"> 5: </span><span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> org-html-htmlize-output-type 'inline-css<span style="color: #707183;">)</span>
<span class="linenr"> 6: </span><span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span> org-publish-project-alist
<span class="linenr"> 7: </span>    '<span style="color: #7388D6;">(</span>
<span class="linenr"> 8: </span>      <span style="color: #909183;">(</span><span style="color: #008000; font-style: italic;">"project-name"</span>
<span class="linenr"> 9: </span>       ......
<span class="linenr">10: </span>   <span style="color: #006FE0;">:htmlized-source</span> t 
<span class="linenr">11: </span>       ......
<span class="linenr">12: </span>       <span style="color: #909183;">)</span>
<span class="linenr">13: </span>       ......<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
完整版的配置详见<a href="http://tonylu.pe.hu/wiki.html">我的 wiki</a>。
</p>
</div>
</div>
</div>
<div id="outline-container-org5cdd00e" class="outline-2">
<h2 id="org5cdd00e"><span class="section-number-2">2</span> 上传 Github</h2>
<div class="outline-text-2" id="text-2">
<p>
上传 github 中，遇到的最大问题就是要生成一个 RSA 密钥，具体步骤参照<a href="http://blog.csdn.net/benweizhu/article/details/8492968">这个链接</a>。利用下面的程序上传文件，就能生成网站了。
</p>

<div class="org-src-container">
<pre class="src src--n">cd C:\\Users\\Administrator\\Dropbox\\org
git add -A ;本地文件有删除用-A，只有增加的文件用 .
git commit -m "add code"
git remote set-url origin git@github.com:luyajun01/luyajun01.github.io.git 
git push origin master
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfe11d1e" class="outline-2">
<h2 id="orgfe11d1e"><span class="section-number-2">3</span> 参考资料</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://guidao.github.io/emacs_blog.html">https://guidao.github.io/emacs_blog.html</a></li>
<li><a href="http://dayigu.github.io/WhyUseOrgModeToWriteBlog.html">http://dayigu.github.io/WhyUseOrgModeToWriteBlog.html</a></li>
<li><a href="http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html</a></li>
<li><a href="https://yuyang0.github.io/articles/org-mode-dropbox-blog.html">https://yuyang0.github.io/articles/org-mode-dropbox-blog.html</a></li>
<li><a href="http://orgmode.org/manual/Publishing-options.html">http://orgmode.org/manual/Publishing-options.html</a></li>
<li><a href="http://blog.csdn.net/benweizhu/article/details/8492968">http://blog.csdn.net/benweizhu/article/details/8492968</a></li>
<li><a href="http://www.i3s.unice.fr/~malapert/org/tips/emacs_orgmode.html">http://www.i3s.unice.fr/~malapert/org/tips/emacs_orgmode.html</a></li>
<li><a href="http://www.zmonster.me/2013/12/02/org8.x-export-source-code.html">http://www.zmonster.me/2013/12/02/org8.x-export-source-code.html</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div><script>
/**
*  RECOMMENDED CONFIGURATION VARIABLES: EDIT AND UNCOMMENT THE SECTION BELOW TO INSERT DYNAMIC VALUES FROM YOUR PLATFORM OR CMS.
*  LEARN WHY DEFINING THESE VARIABLES IS IMPORTANT: https://disqus.com/admin/universalcode/#configuration-variables*/
/*
var disqus_config = function () {
this.page.url = https://luyajun01.github.io;  // Replace PAGE_URL with your page's canonical URL variable
this.page.identifier = PAGE_IDENTIFIER; // Replace PAGE_IDENTIFIER with your page's unique identifier variable
};
*/
(function() { // DON'T EDIT BELOW THIS LINE
var d = document, s = d.createElement('script');
s.src = 'https://tonylu.disqus.com/embed.js';
s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</body>
</html>
